In [2]:
import pandas as pd

pd.Series([1,2,3,4,5,6])

0    1
1    2
2    3
3    4
4    5
5    6
dtype: int64

In [3]:
df=pd.read_csv('employees.csv')
df

   ID           Name Department  Age  Salary Joining_Date
0   1       John Doe         HR   28   50000   2020-05-21
1   2     Jane Smith         IT   34   75000   2019-06-12
2   3    Bob Johnson    Finance   45   85000   2018-07-15
3   4    Alice White         IT   29   72000   2021-01-04
4   5  Charlie Brown  Marketing   32   68000   2019-11-30
5   6      Eva Green         HR   41   54000   2017-04-22
6   7     Mike Davis    Finance   50   90000   2016-08-19
7   8   Linda Taylor         IT   26   64000   2022-02-10
8   9   James Wilson  Marketing   38   70000   2020-09-08
9  10    Sarah Adams         HR   30   55000   2021-03-18

In [5]:
df.sample()

   ID         Name Department  Age  Salary Joining_Date
3   4  Alice White         IT   29   72000   2021-01-04

In [7]:
df.head()

   ID           Name Department  Age  Salary Joining_Date
0   1       John Doe         HR   28   50000   2020-05-21
1   2     Jane Smith         IT   34   75000   2019-06-12
2   3    Bob Johnson    Finance   45   85000   2018-07-15
3   4    Alice White         IT   29   72000   2021-01-04
4   5  Charlie Brown  Marketing   32   68000   2019-11-30

In [8]:
df.info()

<class 'pandas.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 6 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   ID            10 non-null     int64
 1   Name          10 non-null     str
 2   Department    10 non-null     str
 3   Age           10 non-null     int64
 4   Salary        10 non-null     int64
 5   Joining_Date  10 non-null     str
dtypes: int64(3), str(3)
memory usage: 612.0 bytes

In [11]:
df.describe(include="all")

              ID      Name Department        Age        Salary Joining_Date
count   10.00000        10         10  10.000000     10.000000           10
unique       NaN        10          4        NaN           NaN           10
top          NaN  John Doe         HR        NaN           NaN   2020-05-21
freq         NaN         1          3        NaN           NaN            1
mean     5.50000       NaN        NaN  35.300000  68300.000000          NaN
std      3.02765       NaN        NaN   7.958922  13106.826042          NaN
min      1.00000       NaN        NaN  26.000000  50000.000000          NaN
25%      3.25000       NaN        NaN  29.250000  57250.000000          NaN
50%      5.50000       NaN        NaN  33.000000  69000.000000          NaN
75%      7.75000       NaN        NaN  40.250000  74250.000000          NaN
max     10.00000       NaN        NaN  50.000000  90000.000000          NaN

In [12]:
df

   ID           Name Department  Age  Salary Joining_Date
0   1       John Doe         HR   28   50000   2020-05-21
1   2     Jane Smith         IT   34   75000   2019-06-12
2   3    Bob Johnson    Finance   45   85000   2018-07-15
3   4    Alice White         IT   29   72000   2021-01-04
4   5  Charlie Brown  Marketing   32   68000   2019-11-30
5   6      Eva Green         HR   41   54000   2017-04-22
6   7     Mike Davis    Finance   50   90000   2016-08-19
7   8   Linda Taylor         IT   26   64000   2022-02-10
8   9   James Wilson  Marketing   38   70000   2020-09-08
9  10    Sarah Adams         HR   30   55000   2021-03-18

In [14]:
it=df[df['Department']=='IT']
it

   ID          Name Department  Age  Salary Joining_Date
1   2    Jane Smith         IT   34   75000   2019-06-12
3   4   Alice White         IT   29   72000   2021-01-04
7   8  Linda Taylor         IT   26   64000   2022-02-10

In [16]:
avs = df.groupby('Department')['Salary'].mean()
avs

Department
Finance      87500.000000
HR           53000.000000
IT           70333.333333
Marketing    69000.000000
Name: Salary, dtype: float64

In [ ]:
avs = df.groupby('Department')['Salary'].mean().max()
avs

np.float64(87500.0)

In [4]:
df['Salary_After_Raise'] = df['Salary'] * 1.05
print("DataFrame with Salary After Raise:\n" )
df

DataFrame with Salary After Raise:

   ID           Name Department  Age  Salary Joining_Date  Salary_After_Raise
0   1       John Doe         HR   28   50000   2020-05-21             52500.0
1   2     Jane Smith         IT   34   75000   2019-06-12             78750.0
2   3    Bob Johnson    Finance   45   85000   2018-07-15             89250.0
3   4    Alice White         IT   29   72000   2021-01-04             75600.0
4   5  Charlie Brown  Marketing   32   68000   2019-11-30             71400.0
5   6      Eva Green         HR   41   54000   2017-04-22             56700.0
6   7     Mike Davis    Finance   50   90000   2016-08-19             94500.0
7   8   Linda Taylor         IT   26   64000   2022-02-10             67200.0
8   9   James Wilson  Marketing   38   70000   2020-09-08             73500.0
9  10    Sarah Adams         HR   30   55000   2021-03-18             57750.0

In [7]:
age = df.sort_values(by='Age',ascending=False)
age

   ID           Name Department  Age  Salary Joining_Date  Salary_After_Raise
6   7     Mike Davis    Finance   50   90000   2016-08-19             94500.0
2   3    Bob Johnson    Finance   45   85000   2018-07-15             89250.0
5   6      Eva Green         HR   41   54000   2017-04-22             56700.0
8   9   James Wilson  Marketing   38   70000   2020-09-08             73500.0
1   2     Jane Smith         IT   34   75000   2019-06-12             78750.0
4   5  Charlie Brown  Marketing   32   68000   2019-11-30             71400.0
9  10    Sarah Adams         HR   30   55000   2021-03-18             57750.0
3   4    Alice White         IT   29   72000   2021-01-04             75600.0
0   1       John Doe         HR   28   50000   2020-05-21             52500.0
7   8   Linda Taylor         IT   26   64000   2022-02-10             67200.0

In [8]:
salary=df.sort_values(by='Salary',ascending=False)
salary

   ID           Name Department  Age  Salary Joining_Date  Salary_After_Raise
6   7     Mike Davis    Finance   50   90000   2016-08-19             94500.0
2   3    Bob Johnson    Finance   45   85000   2018-07-15             89250.0
1   2     Jane Smith         IT   34   75000   2019-06-12             78750.0
3   4    Alice White         IT   29   72000   2021-01-04             75600.0
8   9   James Wilson  Marketing   38   70000   2020-09-08             73500.0
4   5  Charlie Brown  Marketing   32   68000   2019-11-30             71400.0
7   8   Linda Taylor         IT   26   64000   2022-02-10             67200.0
9  10    Sarah Adams         HR   30   55000   2021-03-18             57750.0
5   6      Eva Green         HR   41   54000   2017-04-22             56700.0
0   1       John Doe         HR   28   50000   2020-05-21             52500.0

In [10]:
x=df.groupby('Department')['ID'].count()
x

Department
Finance      2
HR           3
IT           3
Marketing    2
Name: ID, dtype: int64

In [12]:
count=df['Department'].value_counts().sort_values(ascending=False)
count

Department
HR           3
IT           3
Finance      2
Marketing    2
Name: count, dtype: int64

In [13]:
df.info()

<class 'pandas.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 7 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   ID                  10 non-null     int64
 1   Name                10 non-null     str
 2   Department          10 non-null     str
 3   Age                 10 non-null     int64
 4   Salary              10 non-null     int64
 5   Joining_Date        10 non-null     str
 6   Salary_After_Raise  10 non-null     float64
dtypes: float64(1), int64(3), str(3)
memory usage: 692.0 bytes

In [14]:
df['Joining_Date']=pd.to_datetime(df['Joining_Date'])
recent_joins = df[df['Joining_Date'] > '2020-01-01']
recent_joins

   ID          Name Department  Age  Salary Joining_Date  Salary_After_Raise
0   1      John Doe         HR   28   50000   2020-05-21             52500.0
3   4   Alice White         IT   29   72000   2021-01-04             75600.0
7   8  Linda Taylor         IT   26   64000   2022-02-10             67200.0
8   9  James Wilson  Marketing   38   70000   2020-09-08             73500.0
9  10   Sarah Adams         HR   30   55000   2021-03-18             57750.0

In [15]:
df['farouk']=[1,2,3,4,5,6,7,8,9,10]
df

,ID,Name,Department,Age,Salary,Joining_Date,Salary_After_Raise,farouk
0,1,John Doe,HR,28,50000,2020-05-21,52500.0,1
1,2,Jane Smith,IT,34,75000,2019-06-12,78750.0,2
2,3,Bob Johnson,Finance,45,85000,2018-07-15,89250.0,3
3,4,Alice White,IT,29,72000,2021-01-04,75600.0,4
4,5,Charlie Brown,Marketing,32,68000,2019-11-30,71400.0,5
5,6,Eva Green,HR,41,54000,2017-04-22,56700.0,6
6,7,Mike Davis,Finance,50,90000,2016-08-19,94500.0,7
7,8,Linda Taylor,IT,26,64000,2022-02-10,67200.0,8
8,9,James Wilson,Marketing,38,70000,2020-09-08,73500.0,9
9,10,Sarah Adams,HR,30,55000,2021-03-18,57750.0,10

In [17]:
df=df.drop('farouk',axis=1)
df

   ID           Name Department  Age  Salary Joining_Date  Salary_After_Raise
0   1       John Doe         HR   28   50000   2020-05-21             52500.0
1   2     Jane Smith         IT   34   75000   2019-06-12             78750.0
2   3    Bob Johnson    Finance   45   85000   2018-07-15             89250.0
3   4    Alice White         IT   29   72000   2021-01-04             75600.0
4   5  Charlie Brown  Marketing   32   68000   2019-11-30             71400.0
5   6      Eva Green         HR   41   54000   2017-04-22             56700.0
6   7     Mike Davis    Finance   50   90000   2016-08-19             94500.0
7   8   Linda Taylor         IT   26   64000   2022-02-10             67200.0
8   9   James Wilson  Marketing   38   70000   2020-09-08             73500.0
9  10    Sarah Adams         HR   30   55000   2021-03-18             57750.0